#  Составное присваивание
# +=	Сложение с присвоением: складывает левый операнд с правым, и затем присваивает полученное значение левому операнду	a += b
# -=	Вычитание с присвоением: вычитаем из левого операнда правый, и затем присваивает полученное значение левому операнду	a -= b
# *=	Умножение с присвоением: перемножает левый операнд с правым, и затем присваивает полученное значение левому операнду	a *= b
# /=	Деление с присвоением: делит левый операнд на правый, и затем присваивает полученное значение левому операнду	a /= b
# //=	Деление нацело с присвоением: нацело делит левый операнд на правый, и затем присваивает полученное значение левому операнду	a //= b
# %=	Деление по остатку присвоением: делит по остатку левый операнд на правый, и затем присваивает полученное значение левому операнду	a %= b
# **=	Возведение в степень с присвоением: возводит левый операнд в степень правого операнда, и затем присваивает полученное значение левому операнду	a **= b


a = 30
b = 50

# b = b + 1
b += 1
print('b =', b)

# a = a + b
a += b
print('a =', a)

# a = a + 100
a += 100
print('a =', a)

# b = b - a
b -= a
print('b =', b)

# a = a - 80
a -= 80
print('a =', a)






